app/Controllers/Barang.php

    public function index()
    {
        $redirect = $this->requireLogin();

        if ($redirect !== null) {
            return $redirect;
        }

        $data['barang'] = $this->barangModel->findAll();
---
SELECT *
FROM `barang`

    public function store()
    {
        $redirect = $this->requireAdmin();

        if ($redirect !== null) {
            return $redirect;
        }

        $this->barangModel->save([
            'kode_barang' => $this->request->getPost('kode_barang'),
            'nama_barang' => $this->request->getPost('nama_barang'),
            'harga' => $this->request->getPost('harga'),
            'stok' => $this->request->getPost('stok')
        ]);
---
INSERT INTO `barang` (`kode_barang`, `nama_barang`, `harga`, `stok`) VALUES ('BRG004', 'Tegal', '1000000', '1')

    public function delete($id)
    {
        $redirect = $this->requireAdmin();

        if ($redirect !== null) {
            return $redirect;
        }

        $this->barangModel->delete($id);
---
DELETE FROM `barang`
WHERE `id` IN ('5')