app/Controllers/Barang.php

    public function edit($id)
    {
        $data['barang'] = $this->barangModel->find($id);
---
SELECT *
FROM `barang`
WHERE `barang`.`id` = '1'