app/Controllers/Laporan.php

SELECT *
FROM `transaksi`
ORDER BY `tanggal` DESC
---
    public function index()
    {
        $redirect = $this->requireAdmin();

        if ($redirect !== null) {
            return $redirect;
        }

        $data['transaksi'] = $this->transaksiModel
            ->orderBy('tanggal', 'DESC')
            ->findAll();