app/Controllers/Transaksi.php

    public function index()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        $data['barang'] = $this->barangModel->findAll();
---
SELECT *
FROM `barang`

    }

    foreach ($qtyPerBarang as $barangId => $qty) {
        $barang = $this->barangModel->find($barangId);
---
SELECT *
FROM `barang`
WHERE `barang`.`id` = 1

    $db = \Config\Database::connect();
    $db->transStart();

    $transaksiId = $this->transaksiModel->insert([
        'kode_transaksi' => $kodeTransaksi,
        'total' => $total,
        'bayar' => $bayar,
        'kembalian' => $kembalian,
        'user_id' => session()->get('user_id')
    ], true);
---
INSERT INTO `transaksi` (`kode_transaksi`, `total`, `bayar`, `kembalian`, `user_id`) VALUES ('TRX20260612152016', 26500, 30000, 3500, '1')

            'subtotal' => $item['subtotal']
        ]);

        $this->barangModel->update($barang['id'], [
            'stok' => $barang['stok'] - $qty
        ]);
---
UPDATE `barang` SET `stok` = 95
WHERE `barang`.`id` IN ('1')